HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralFoam/shockTube/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line
    {
        type    face;
        axis    x;
        start   (-5 0 0);
        end     (5 0 0);
        nPoints 100;
    }
);

fields          ( p U.component(0) T rho );


// ************************************************************************* //
